{"navigation":[{"section":"1","title":"Analysis summary"},{"section":"2","title":"Factors affecting your bill"},{"section":"3","title":"Comparing plans"},{"section":"4","title":"Resources"}],"section1":{"title":"Analysis summary","heading":"Lessons from real Texas solar owners","textBlock1":[{"type":"text","value":"Distributed solar is an important part of Texas’ energy future. Investing in local energy solutions like rooftop solar improves the reliability of the Texas energy grid but without state incentives or a statewide net metering policy, many consumers who want solar don’t know where to start or what adding solar means for their utility bills. The economics of rooftop solar varies dramatically, based upon customer-selected rate plans from competitive energy retailers, a fixture of Texas’s unique, deregulated electricity market."},{"type":"text","value":"In the last year using Smart Meter Texas data, we’ve analyzed the energy usage and energy production patterns of more than 300 Texas solar owners and compared them to available retail electricity plans in their area. This free service is available to anyone in Oncor and Centerpoint service territories. What we found shows that a solar owner’s choice of retail plan can have a big impact on the savings (over $500/year or more) their solar arrays provide and often solar owners are on the wrong plan. Factors like when and how much someone uses electricity and when and how much solar energy they produce determine which plan makes the most sense for them. Being on the right plan can help more people make the switch to solar with confidence while also making valuable contributions to the resiliency of the Texas grid."}],"planDefinitions":[{"plan":"1:1 Buyback","definition":"These plans offer the same  kilowatt-hour (kWh) credit for solar energy you export to the grid as the rate you pay for using a kWh from the grid. Depending on the rate per kWh you are paying, these plans are often better suited to solar arrays that export more electricity to the grid."},{"plan":"No Buyback","definition":"These plans do not offer any compensation for exported solar energy but can have very competitive pricing for the electricity you import from the grid. If you are a solar owner who uses most of the energy you generate directly in your home rather than exporting it to the grid, this type of plan may offer the shortest payback for your solar investment."},{"plan":"Free Nights and Weekends","definition":"As the name implies, you are not paying for electricity on the weekends and at night. For some users that have appliances or electric vehicles that use a lot of electricity at one time, timing when they draw power can lower your monthly electricity bill and maximize the value of your solar investment."}],"figures":[{"fig":"1","title":"Solar array sizes","caption":"A significant percentage of surveyed solar owners have large system (> 10kW)."},{"fig":"2","title":"Export/import ratios","caption":"Electricity you export to the grid vs. how much you import from the grid; For example, if you import 1000 kWh each month (you pay for them), an export/import ratio of 40% means in that same month you sent 400 kWh of solar energy to the grid (back through your meter). A lower ratio means you’re using more solar energy at home immediately as soon as you make it. A higher ratio means you are sending more to the grid."},{"fig":"3","title":"Recommended plans by type","caption":"Total plans recommended by plan type (1:1 buyback, no buyback, free nights/weekends); (+ sentence commentary on the actual graphic)"},{"fig":"4","title":"Wrong plans","caption":"Total solar owners who were on a plan saving them less money than they could have saved by selecting another plan; (+ sentence commentary on the actual graphic)"},{"fig":"5","title":"Wrong plans by plan type","caption":"People who were on the wrong plan categorized by plan type before they made the switch; (+ sentence commentary on the actual graphic)"},{"fig":"6","title":"Wrong plans by export/import ratio","caption":"People on each plan type by export/import ratio category; (+ sentence commentary on the actual graphic)"},{"fig":"7","title":"Expected savings after switching","caption":"After switching to the recommended plan, these are the ranges of savings we expect solar owners to see. (+ sentence commentary on the actual graphic)"}]},"section2":{"title":"Factors affecting your bill","heading":"Solar value varies widely","overview":"In most places, solar homeowners receive a credit on their monthly utility bill for this excess electricity their system produces. When the excess generation is credited at the same rate as the customer’s consumption this is known as net metering. It ensures solar homeowners receive fair credit for the electricity their systems generate and helps them see a return on their investment into solar. Net metering policies are enacted at the state level. Thirty-eight states require utilities to offer net-metering. Texas is not one of them. If you buy electricity from a Retail Electricity Provider in Texas, the plan you choose will impact your solar savings as will these factors which vary from household to household:","steps":[{"step":"1","text":"Your electrical bill depends on how much of your daily electricity is <strong>imported</strong> from the grid versus <strong>generated</strong> with a home solar system."},{"step":"2","text":"The light gray bars represent your electricity <strong>usage</strong> each hour throughout a typical day."},{"step":"3","text":"A solar system will generate electricity during daylight hours. <br><br> The dark gray bars show how much electricity is <strong>generated</strong> per hour throughout the day."},{"step":"4","text":"Your electric bill is based on the amount of electricity you import from the grid. <br><br>The amount you import depends on the difference between your <strong>usage</strong> and <strong>generation</strong> throughout the day."},{"step":"6","text":"Without any solar generation, all of your electricity is <strong>imported</strong> from the grid."},{"step":"7","text":"With a large solar array, you might generate more electricity than you use. <br><br> The excess energy is <strong>exported</strong> back to the grid, and - with some retail electric plans - you earn money for this."}]},"section3":{"title":"Comparing plans","overview":"There are hundreds of Retail Electricity plans available from providers. To help you compare, we’ve categorized plans into three basic groups: No Buyback, 1:1 Buyback Plans, and Free Nights and Weekends. When you adjust the different factors impacting solar savings, the analysis tool will show you what plan type is most likely to be the best.","parameters":["How much electricity you use from the utility","When you use electricity","How much electricity you generate from solar"]},"section4":{"title":"Resources","resources":[{"name":"Solar generation credits explained","link":"https://www.solarunitedneighbors.org/texas/learn-the-issues-in-texas/net-metering-in-texas/","text":"Learn more about how solar is valued in Texas"},{"name":"Find the right retail plan","link":"https://www.texaspowerguide.com/solar-electric-plan-analysis/","text":"Maximize your solar savings by using this free tool to help you decide which retail plan on the market is the best fit for you and your energy usage."},{"name":"Learn about Smart Meter Texas","link":"https://www.resource3.com","text":""}]},"footer":{}}